Mark-Angulo/PlantMetrics/EvalBoards/TI/Tiva C Launchpad EK-TM4C123GXL/PlantMetrics/app.c
/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                           APPLICATION CODE
*
*                                      Texas Instruments TM4C129x
*                                                on the
*                                             DK-TM4C129X
*                                           Development Kit
*       		Modified by Dr. Samir A. Rawashdeh, for the TM4C123GH6PM microcontroller on the 
*						TM4C123G Tiva C Series Launchpad (TM4C123GXL), November 2014.
*
* Filename      : app.c
* Version       : V1.00
* Programmer(s) : FF
*********************************************************************************************************
* Note(s)       : None.
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include  "app_cfg.h"
#include  <cpu_core.h>
#include  <os.h>

#include  "..\bsp\bsp.h"
#include  "..\bsp\bsp_led.h"
#include  "..\bsp\bsp_sys.h"

// SAR Addition
#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

#include "Ports.h"

/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                           LOCAL CONSTANTS
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                          LOCAL DATA TYPES
*********************************************************************************************************
*/


/*$PAGE*/
/*
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*/

static  OS_STK       AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE];
static  OS_STK       Task1Stk[APP_CFG_TASK_START_STK_SIZE];
static  OS_STK       Task2Stk[APP_CFG_TASK_START_STK_SIZE];
static  OS_STK       Task3Stk[APP_CFG_TASK_START_STK_SIZE];
static  OS_STK       Task4Stk[APP_CFG_TASK_START_STK_SIZE];


/*
*********************************************************************************************************
*                                            LOCAL MACRO'S
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                      LOCAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/

static  void  AppTaskCreate         (void);
static  void  AppTaskStart          (void       *p_arg);
static  void  Task1          (void       *p_arg);
static  void  Task2          (void       *p_arg);
static  void  Task3          (void       *p_arg);
static  void  Task4          (void       *p_arg);

/*$PAGE*/
/*
*********************************************************************************************************
*                                               main()
*
* Description : Entry point for C code.
*
* Arguments   : none.
*
* Returns     : none.
*
* Note(s)     : (1) It is assumed that your code will call main() once you have performed all necessary
*                   initialization.
*********************************************************************************************************
*/

int  main (void)
{
	INT16U opts;
	
	#if (OS_TASK_NAME_EN > 0)
			CPU_INT08U  err;
	#endif

	#if (CPU_CFG_NAME_EN == DEF_ENABLED)
			CPU_ERR     cpu_err;
	#endif

	#if (CPU_CFG_NAME_EN == DEF_ENABLED)
			CPU_NameSet((CPU_CHAR *)"TM4C129XNCZAD",
									(CPU_ERR  *)&cpu_err);
	#endif

			Ports_Init(); //Init ADC port
			
			CPU_IntDis();                                               /* Disable all interrupts.                              */

			OSInit();                                                   /* Initialize "uC/OS-II, The Real-Time Kernel"          */
	
			opts = (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR );

			OSTaskCreateExt((void (*)(void *)) AppTaskStart,           /* Create the start task                                */
											(void           *) 0,
											(OS_STK         *)&AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE - 1],
											(INT8U           ) APP_CFG_TASK_START_PRIO,
											(INT16U          ) APP_CFG_TASK_START_PRIO,
											(OS_STK         *)&AppTaskStartStk[0],
											(INT32U          ) APP_CFG_TASK_START_STK_SIZE,
											(void           *) 0,
											(INT16U          )opts);

	#if (OS_TASK_NAME_EN > 0)
			OSTaskNameSet(APP_CFG_TASK_START_PRIO, "Start", &err);
	#endif

			OSStart();                                                  /* Start multitasking (i.e. give control to uC/OS-II)   */

		
    while (1) {
			;
    }
}


/*$PAGE*/
/*
*********************************************************************************************************
*                                           App_TaskStart()
*
* Description : Startup task example code.
*
* Arguments   : p_arg       Argument passed by 'OSTaskCreate()'.
*
* Returns     : none.
*
* Created by  : main().
*
* Notes       : (1) The first line of code is used to prevent a compiler warning because 'p_arg' is not
*                   used.  The compiler should not generate any code for this statement.
*********************************************************************************************************
*/

static  void  AppTaskStart (void *p_arg)
{
		CPU_INT32U  cpu_clk_freq;
    CPU_INT32U  cnts;
    (void)p_arg;                                                /* See Note #1                                              */


   (void)&p_arg;

    BSP_Init();                                                 /* Initialize BSP functions                             */

    cpu_clk_freq = BSP_SysClkFreqGet();                         /* Determine SysTick reference freq.                    */
    cnts         = cpu_clk_freq                                 /* Determine nbr SysTick increments                     */
                 / (CPU_INT32U)OS_TICKS_PER_SEC;

    OS_CPU_SysTickInit(cnts);
    CPU_Init();                                                 /* Initialize the uC/CPU services                       */

#if (OS_TASK_STAT_EN > 0)
    OSStatInit();                                               /* Determine CPU capacity                                   */
#endif

    Mem_Init();

#ifdef CPU_CFG_INT_DIS_MEAS_EN
    CPU_IntDisMeasMaxCurReset();
#endif


		BSP_LED_Toggle(0);
		OSTimeDlyHMSM(0, 0, 0, 200);
		BSP_LED_Toggle(0);
		BSP_LED_Toggle(1);
		OSTimeDlyHMSM(0, 0, 0, 200);
		BSP_LED_Toggle(1);
		BSP_LED_Toggle(2);
		OSTimeDlyHMSM(0, 0, 0, 200);    
		BSP_LED_Toggle(2);

		OSTimeDlyHMSM(0, 0, 1, 0);   

		AppTaskCreate();                                            /* Creates all the necessary application tasks.         */

    while (DEF_ON) {

        OSTimeDlyHMSM(0, 0, 0, 200);			

    }
}


/*
*********************************************************************************************************
*                                         AppTaskCreate()
*
* Description :  Create the application tasks.
*
* Argument(s) :  none.
*
* Return(s)   :  none.
*
* Caller(s)   :  AppTaskStart()
*
* Note(s)     :  none.
*********************************************************************************************************
*/

static  void  AppTaskCreate (void)
{
OSTaskCreate((void (*)(void *)) Task1,           /* Create the second task                                */
                    (void           *) 0,							// argument
                    (OS_STK         *)&Task1Stk[APP_CFG_TASK_START_STK_SIZE - 1],
                    (INT8U           ) 5 );  						// Task Priority
                

OSTaskCreate((void (*)(void *)) Task2,           /* Create the second task                                */
                    (void           *) 0,							// argument
                    (OS_STK         *)&Task2Stk[APP_CFG_TASK_START_STK_SIZE - 1],
                    (INT8U           ) 6 );  						// Task Priority
										
OSTaskCreate((void (*)(void *)) Task3,           /* Create the second task                                */
                    (void           *) 0,							// argument
                    (OS_STK         *)&Task3Stk[APP_CFG_TASK_START_STK_SIZE - 1],
                    (INT8U           ) 7 );  						// Task Priority
										
OSTaskCreate((void (*)(void *)) Task4,           /* Create the second task                                */
                    (void           *) 0,							// argument
                    (OS_STK         *)&Task4Stk[APP_CFG_TASK_START_STK_SIZE - 1],
                    (INT8U           ) 8 );  						// Task Priority
         										
}


//Thermistor Sensor (ADC)- Temperature of Soil
static  void  Task1 (void *p_arg)
{
   (void)p_arg;
	
    while (1) {              
			UARTprintf("T1: Soil Temp = %i\n", Get_Temp());
      OSTimeDlyHMSM(0, 0, 2, 0);
		}
}

//Soil Moisture Sensor (I2C) - STEMMA
static  void  Task2 (void *p_arg)
{
   (void)p_arg;
	
    while (1) {              
			BSP_LED_Toggle(1);
			UARTprintf("T2: Soil Moisture = %i\n", Get_SoilMoisture());
			OSTimeDlyHMSM(0, 0, 2, 0);
		}
}

//Light Sensor (I2C) - VEML7700
static  void  Task3 (void *p_arg)
{
   (void)p_arg;
	
    while (1) {              
			BSP_LED_Toggle(2);
			UARTprintf("T3: rawALS = %i\n", Get_Brightness());
			OSTimeDlyHMSM(0, 0, 2, 0);
		}
}

//Enviroment Sensor (I2C) - Humidity & Outside Temperature - Sensirion SHT31-D
static  void  Task4 (void *p_arg)
{
   (void)p_arg;
	
    while (1) {
			BSP_LED_Toggle(0);
			UARTprintf("T4: Humidity = %i\n    Temp = %i\n", Get_EnviromentInfo('H'), Get_EnviromentInfo('T'));
			OSTimeDlyHMSM(0, 0, 2, 0);
		}
}
